[
  {
    "path": "posts/2026-02-13-showcase/",
    "title": "Political A/B Testing: Homepage Conversion Analysis",
    "description": "An analysis of simulated A/B test data for a political party's website, comparing Linear Probability and Logistic Regression Models.",
    "author": [
      {
        "name": "Holly Lloyd",
        "url": {}
      }
    ],
    "date": "2026-02-13",
    "categories": [],
    "contents": "\r\n\r\nContents\r\nOverview\r\nSimulating the A/B Test Data\r\nCode: Simulate the experiment\r\nInspect the data\r\nWritten Analysis\r\nSignup Rates and Difference-in-Means ATE\r\nCode: Group means and bar plot\r\nCode: Difference-in-means ATE\r\nWritten Analysis\r\n\r\nLinear Probability Model (lm) vs logit (glm)\r\nCode: Linear probability model\r\nWritten Analysis\r\nCode: Logistic regression (logit)\r\nCode: Predicted probabilities under control and treatment\r\nWritten Analysis\r\n\r\nComparing lm and logit visually\r\nCode: Plot with fitted probabilities\r\nWritten Analysis\r\n\r\nHeterogeneous Effects by Age or Interest (Interaction)\r\nWritten Analysis:\r\nEthical Reflection on Political A/B Testing\r\n\r\nOverview\r\nIn this assignment, I will work with a simulated A/B test run by a fictitious political party delivering messages on its official website.\r\nThe party wants to increase the probability that visitors sign up as supporters.\r\nTo do this, they are going to test two homepage versions:\r\nControl homepage (Version A):\r\nStandard party messaging (policy highlights, leader photo, “Join us” button).\r\nIssue-focused homepage (Version B):\r\nEmphasizes a hot-button issue, such as immigration, important to the party’s base, plus a “Join us” button.\r\nVisitors are randomly assigned to Version A or Version B when they land on the website.\r\nThe outcome variable is:\r\nsupport_signup = 1 if the website visitor signs up as a party-supporter\r\nsupport_signup = 0 otherwise\r\nIn this showcase, I will:\r\nSimulate the data for this A/B test\r\nExplore and visualise the sign-up rates for each homepage\r\nEstimate the Average Treatment Effect (ATE) using:\r\nA difference-in-means calculation\r\nA linear probability model (lm)\r\nA logistic regression (glm with logit link)\r\n\r\nCompare the models and interpret the results\r\nInterpret heterogeneity by using an interaction\r\nReflect briefly on ethical issues in running experiments in politics\r\nSimulating the A/B Test Data\r\nI will simulate data for n = 1500 website visitors.\r\nAssuming:\r\nBaseline signup probability under the control homepage is 0.12.\r\nThe issue-focused homepage increases signup probability by 0.05, to 0.17.\r\nCode: Simulate the experiment\r\n\r\n\r\n\r\nInspect the data\r\n\r\nvisitor_id\r\ntreatment\r\nsupport_signup\r\n1\r\n1\r\n1\r\n2\r\n0\r\n0\r\n3\r\n1\r\n0\r\n4\r\n1\r\n0\r\n5\r\n0\r\n1\r\n6\r\n1\r\n1\r\n\r\nvisitor_id\r\ntreatment\r\nsupport_signup\r\n\r\nMin. : 1.0\r\nMin. :0.0000\r\nMin. :0.0000\r\n\r\n1st Qu.: 375.8\r\n1st Qu.:0.0000\r\n1st Qu.:0.0000\r\n\r\nMedian : 750.5\r\nMedian :0.0000\r\nMedian :0.0000\r\n\r\nMean : 750.5\r\nMean :0.4993\r\nMean :0.1393\r\n\r\n3rd Qu.:1125.2\r\n3rd Qu.:1.0000\r\n3rd Qu.:0.0000\r\n\r\nMax. :1500.0\r\nMax. :1.0000\r\nMax. :1.0000\r\nGroup\r\nSigned up?\r\nTotal\r\nControl\r\nNo\r\n662\r\nControl\r\nYes\r\n89\r\nTreatment\r\nNo\r\n629\r\nTreatment\r\nYes\r\n120\r\n\r\nWritten Analysis\r\nWhat does treatment represent in this experiment?\r\nWithin the above experiment, ‘treatment’ refers to the random assignment of web traffic to two different political website homepages. A given value of 0 indicates the visitor saw the control page, while an individual with a value of 1 viewed a homepage that focused on a relevant hot-topic.\r\nWhat are Y0 and Y1, conceptually?\r\nY0 and Y1 represent potential outcomes. Y0 depicts the signup decision a visitor may have made having viewed the standard homepage. However, Y1 is the decision that the same visitor may have made upon viewing the issue-focused webpage. \r\nWhy do we only observe one of Y0 or Y1 for each visitor? Why is this a problem for causality?\r\nEach visitor can only produce either Y0 or Y1 as they are only shown the assigned website homepage once. This is due to the problem of causal inference. As both outcomes cannot be viewed by a single individual, the individual treatments effects cannot be measured and causality is determined through averaging the outcomes of each group.\r\nWhat does support_signup represent in terms of potential and realised outcomes?\r\n‘support_signup’ represents the realised outcome, which is shown as a visitor’s ‘yes’ or ‘no’ decision. This contrasts from the Y1 and Y0, as these represent the possible decisions a visitor may make whereas ‘support_signup’ is the actual result received from an individual that is recorded along with their assigned website homepage\r\nSignup Rates and Difference-in-Means ATE\r\nI will now estimate the average signup rate under each homepage version and compute the difference.\r\n\r\nHomepage Version\r\nMean Signup Rate\r\nControl Homepage\r\n0.119\r\nIssue-Focused Homepage\r\n0.160\r\n\r\nCode: Group means and bar plot\r\n\r\n\r\n\r\nCode: Difference-in-means ATE\r\n\r\n0.041705\r\n\r\nWritten Analysis\r\nInterpret mean_control and mean_treated in plain language.\r\n‘mean_control’ signifies the basic signup rate, as it is the proportion of visitors who signed up after viewing the original website homepage.\r\nOn the other hand,‘mean_treated’ represent the test signups. It shows the proportion of visitors who joined upon viewing the hot-topic focused webpage. \r\nConvert ate_hat into percentage points . What does it mean, in words, for the party’s digital strategy?\r\n4.17%\r\nThe above percentage suggests that the party benefits by a 4.17% increase in signups through using their webpage to promote hot-topic issues to their web traffic.\r\nIgnoring uncertainty for the moment, would this result encourage the party to adopt the issue-focused homepage? Why or why not?\r\nIgnoring uncertainty, this result does encourage the party to adopt an issue-focused home page. As the primary goal of any digital marketing strategy is to increase the number of supporters, gaining 4.17 percentage points achieves this goal and is an improvement on the previous webpage.\r\nChange two things about this plot to make it more interesting/readable\r\nUpon initially viewing the plot, I altered the colours to suit my preferable colour-blind friendly palette. I then edited the capitalisation of the title and included a subtitle for the plot. In terms of direct changes to the plot itself, I included error bars and their percentages (which I adjusted to above the bars using vjust). Additionally, the y-axis was transformed from decimals into percentage points in order to increase the clarity and understand-ability of the plot. \r\nLinear Probability Model (lm) vs logit (glm)\r\nI will now estimate the ATE using our workhorse regression model.\r\nCode: Linear probability model\r\n\r\nVariable\r\nEstimate\r\nStd. Error\r\nt-value\r\nP-value\r\nLower CI\r\nUpper CI\r\nBaseline (Control)\r\n0.1185\r\n0.0126\r\n9.3891\r\n0.0000\r\n0.0938\r\n0.1433\r\nCampaign Effect (Treatment)\r\n0.0417\r\n0.0179\r\n2.3348\r\n0.0197\r\n0.0067\r\n0.0767\r\nR-Squared\r\nAdj. R-Squared\r\nResidual Std. Error\r\nModel P-value\r\n0.0036\r\n0.003\r\n0.3459\r\n0.0197\r\n\r\nWritten Analysis\r\nWhat does the intercept in lm_model estimate in this context?\r\nThe model’s intercept of 0.11851 represents the predicted mean of ‘support_signup’ for the control group.\r\nWhat does the coefficient on treatment estimate, and how does it relate to ate_hat?\r\n0.04170 is the coefficient for treatment which estimates the Average Treatment Effect (ATE). This coefficient represents the differences fo mean ‘support_signup’ between the control and the treatment groups. Within a linear model, the coefficient is identical to the estimated difference in mean, or ‘ate_hat’. \r\nCheck numerically that the treatment coefficient equals the difference in means from Section 2. Are they the same?\r\nThrough the below code block, it can be seen that the ‘treatment’ coefficient equals the difference in mean as the use of the near() function returns TRUE. This means that the data rounds to the same number. \r\n\r\ntreatment\r\nTRUE\r\n\r\nCode: Logistic regression (logit)\r\n\r\nTerm\r\nEstimate\r\nStd. Error\r\nz-value\r\nP-value\r\n(Intercept)\r\n-2.0066\r\n0.1129\r\n-17.7736\r\n0.0000\r\ntreatment\r\n0.3500\r\n0.1506\r\n2.3245\r\n0.0201\r\n\r\nIn the next section, I am going to go to some lengths to interpret these coefficients. Why would I have to do this?\r\nExtra effort is needed to interpret these coefficients as a linear probability model and a logit model have been used, therefore work is needed as these model outputs denote different ‘units’. Ultimately, this is due to the use of log-odds within the logit model. Despite the extra effort, the trouble may be worth the extra effort as linear models are often preferred for their increased ‘readability’ whereas logit models are often considered more ‘robust’ as probabilities remain between 0 and 1. Additionally, through noticing the similarity of p-values between the models suggests that despite the difference in model, the statistical evidence for the treatment effect may remain consistent.\r\nCode: Predicted probabilities under control and treatment\r\n\r\nControl Probability.1\r\n0.1185\r\nTreated Probability.1\r\n0.1602\r\nLogit ATE.1\r\n0.0417\r\n\r\nWritten Analysis\r\nInterpret p_hat_control and p_hat_treated in plain language.\r\n‘p_hat_control’ represents the predicted probability of signup for an individual from the control group. Whereas, ‘p_hat_treated’ represents the predicted probability of signup for an individual from the treatment group.\r\nCompare ate_logit to ate_hat and the treatment coefficient from lm_model. Are they similar or different? Why might they be close in this simple A/B test?\r\nate_logit = 0.04170496\r\ntreatment coefficient = 0.04170496\r\nate_hat = 0.041705\r\nThe data above is identical (due to rounding). A simple A/B test with one binary predictor means that both the linear and logit model are considered as ‘saturated’, due to the mean calculation of either group. Additionally, when converting logit models from log-odds to the probability scale, the predicted probabilities will match the OLS coefficient.\r\nComparing lm and logit visually\r\nI will now visualise how the two models fit the data.\r\nCode: Plot with fitted probabilities\r\n\r\n\r\n\r\nWritten Analysis\r\nAssuming I was hired as an analyst for the political party and I have to present these findings to my employer. The people that I am giving the presentation to do not have much quantitative experience. How might I show the information above in a way that is easy to understand?:\r\nHow different are the predicted sign-up probabilities from the two models for each group?\r\nWithin the control group both models indicated a potential signup rate of ~11.85%. The treatment group models suggest a signup rate of ~16.02%. Thus whether utilising a linear or logit model, it was found that the treatment increased the chance of an individual signing up by ~4.17% \r\nDoes either model seem clearly inappropriate here, or do they both tell a similar story?\r\nAlthough using a linear model in many complex scenarios may be considered inappropriate due to the potential output of impossible probabilities, i.e. -5% or 115%. Within A/B testing, both the linear and logit models are considered ‘saturated’. This means that they identify the averages across a specified group and therefore, as seen in the above plot, the outcomes are the same.\r\nWhich model is preferable and why?\r\nIn the context of presenting this information to individuals who may lack a complex understanding of quantitative methods, the preferred method would be the linear model. This model allows for an easier interpretation of the 4.17% increase as log-odds do not need to be explained. Therefore increasing clarity for more intuitive decision-making as well as saving time and effort.\r\nHeterogeneous Effects by Age or Interest (Interaction)\r\nNow, I am going to add simulated covariates. The two variables I will make are age and high political interest.\r\nAssuming visitors are between 18 and 75, and age is roughly distributed normal around 40\r\n\r\nvisitor_id\r\ntreatment\r\nsupport_signup\r\nage\r\nhigh_interest\r\n1\r\n1\r\n1\r\n60\r\n0\r\n2\r\n0\r\n0\r\n42\r\n0\r\n3\r\n1\r\n0\r\n53\r\n0\r\n4\r\n1\r\n0\r\n29\r\n1\r\n5\r\n0\r\n1\r\n38\r\n1\r\n6\r\n1\r\n1\r\n32\r\n0\r\n\r\nNext, I am going to run an interaction with treatment and interest\r\n\r\nTerm\r\nEstimate\r\nStd. Error\r\nt-value\r\nP-value\r\n(Intercept)\r\n0.1208791\r\n0.0162264\r\n7.4495498\r\n0.0000000\r\ntreatment\r\n0.0402688\r\n0.0229729\r\n1.7528849\r\n0.0798266\r\nhigh_interest\r\n-0.0060143\r\n0.0258461\r\n-0.2326947\r\n0.8160303\r\ntreatment:high_interest\r\n0.0036501\r\n0.0365678\r\n0.0998182\r\n0.9205020\r\n\r\nWritten Analysis:\r\nWhat is the implied treatment effect by interest subgroup. Note that interest is coded 0,1.\r\n0.044001 + (-0.006143) = 0.037858\r\nThe treatment appears to be slightly more effective for individuals with a low political interest, however due to the interaction term nor being significant to the standard 0.05, there may be more analysis necessary.\r\nWhat is the treatment effect when age = 0? Is this a meaningful baseline?\r\nWhen age = 0, the treatment effect is estimated by the treatment coefficient of 0.04170496. Despite the significance of this output, it is not a meaningful number as the simulated age for voters lies between 18 and 75 which makes this an extrapolation of data that does not represent an individual or set of people within this data set. Additionally, 0-year-olds would be unable to see the treatment or control groups and also lack the cognitive ability to signup, even if they were legally allowed to vote. \r\nWhich variable gives information of how the treatment effect changes for each additional year of age? How do would they be interpretted?\r\nThis would be the interaction term which is able to denote whether the campaign is increasing in yield or decreasing as age increases. If an interaction term is positive, it means that the effectiveness of treatment is increasing with the age of the individual, however a negative term means that the treatment is losing impact, or decreasing, as age increases. \r\nPlot the treatment effects at specific ages (e.g., 25, 40, 60).\r\n\r\nAge\r\nControl Rate\r\nTreatment Rate\r\nTotal Lift\r\n18\r\n0.1141\r\n0.1601\r\n0.0460\r\n25\r\n0.1155\r\n0.1601\r\n0.0446\r\n40\r\n0.1185\r\n0.1602\r\n0.0418\r\n60\r\n0.1224\r\n0.1603\r\n0.0379\r\n75\r\n0.1254\r\n0.1604\r\n0.0351\r\n\r\n\r\nEthical Reflection on Political A/B Testing\r\nSo far, I have treated this like a standard A/B test. But here the product is a political message, and the outcome is political support.\r\nWhat could be some potential ethical considerations that may arise when a political party runs an A/B test on website visotors?\r\nThrough conducting A/B testing, in the eyes of analysts, the voters are transformed into data points which raises some significant ethical concerns in terms of informed consent. Unlike with usual methods and fields of research, conducting experiments through the use of political messaging can create a direct impact on civic beliefs and election outcomes. The use of statistical models that isolate ‘high interest’ voters may enable political parties to micro-target specific groups of individuals, perhaps causing filter bubbles in which differing target groups receive alternate contradictory promises. Furthermore, utilising this practice may deteriorate shared factual political realities through a prioritisation of persuasion over public interaction.\r\nIn addition, although Average Treatment Effect (ATE) can measure mathematical efficiency, it does not account for the contents of an imposed treatment condition. For example, using a 4.17% lift as a method of justification for fear-based messaging or misinformation underscores an intense conflict between statistical successes and real-world moral responsibilities. As website traffic would likely be unaware of their participation in online behavioural experiments, this treatment condition may end up shifting an individual’s political supports and thus the lack of transparency may adjust just persuasion toward psychological engineering.\r\nIn consequence, there is a risk of immorality within political parties that incorporate unwitting internet traffic into research may prioritise percentage lift over the necessity of informed consent and participation. An approach such as this may be viewed as conversion-focused and thus may reduce democratic transparency to data-driven transactions, perhaps erosion the transparency of which public trust is built upon.\r\n\r\n\r\n\r\n",
    "preview": "posts/2026-02-13-showcase/showcase_files/figure-html5/group-means-plot-1.png",
    "last_modified": "2026-02-13T17:59:25+00:00",
    "input_file": "showcase.knit.md"
  }
]
